FV2510/E_0456.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">6.9.1: AD: Übermittlung des Lieferscheins zur Netznutzungsabrechnung</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    fontsize=12;
    pad=0.25;
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#8ba2d7", label=<<B>E_0456</B><BR align="left"/><FONT>Prüfende Rolle: <B>LF</B></FONT><BR align="center"/>>, fontname="Roboto, sans-serif"];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>1: </B>Handelt es sich bei der Marktlokation um eine verbrauchende Marktlokation?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A01" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A01</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Für diese Marktlokation ist kein Lieferschein zu versenden.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>2: </B>Liegt das Endedatum des Zeitraums des Lieferscheins in der Zukunft?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A02" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A02</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Endedatum liegt in der Zukunft.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>3: </B>Entspricht der Typ dieses Lieferscheins (Grund-/Arbeitspreis bzw.<BR align="left"/>Arbeits-/Leistungspreis) für den übermittelten Zeit-raum der an der<BR align="left"/>Marktlokation hinterlegten Netznutzungsabrechnungsvariante (Grund-/Arbeitspreis<BR align="left"/>bzw. Arbeits-/Leistungspreis), welche sich aus der Artikel-ID bzw.<BR align="left"/>Gruppenartikel-ID ergibt, falls die Netznutzungsabrech-nungsvariante nicht<BR align="left"/>explizit über entsprechende Codes ausgetauscht wurde?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A03" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A03</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Der Typ des Lieferscheins ist nicht identisch zur<BR align="left"/>Netznutzungsabrechnungsvariante.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>4: </B>Handelt es sich um einen Lieferschein vom Typ „Grund-/ Arbeitspreis“?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>5: </B>Liegt in dem Lieferschein genannten Zeitraum mindestens ein Tag eines noch<BR align="left"/>nicht stornierten Lieferscheins?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A04" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A04</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Überschneidender Zeitraum in noch nicht stornierten Lieferscheinen<BR align="left"/>„Arbeits-/Grundpreis“<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>6: </B>Handelt es sich um eine Marktlokation mit der Messtechnischen Einordnung „keine<BR align="left"/>Messung“ (pauschale Marktlokation)?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "7" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>7: </B>Entspricht die im Lieferschein übermittelte Energiemenge der Energiemenge,<BR align="left"/>welche sich aus der zuvor für den Zeitraum ausgetauschten<BR align="left"/>Jahresverbrauchsprognose ergibt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A05" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A05</B><BR align="left"/><BR align="left"/><FONT>Cluster: Zustimmung<BR align="left"/>Zustimmung<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "A06" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A06</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Energiemenge für pauschale Marktlokation stimmt nicht überein.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "8" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>8: </B>Liegen nach Reklamation beim MSB für den korrespondierenden Zeitraum des<BR align="left"/>Lieferscheins die Energiemengen an der Marktlokation vom MSB vor?<BR align="left"/>Hinweis: Sollten die Energiemengen an der Marktlokation vom MSB für den<BR align="left"/>korrespondierenden Zeitraum nicht vorliegen, müssen diese erst vom LF beim MSB<BR align="left"/>reklamiert worden sein, bevor diese Frage mit nein beantwortet werden darf.<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A07" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A07</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Energiemengen vom MSB an der Marktlokation fehlen und sind beim MSB reklamiert<BR align="left"/>Hinweis:<BR align="left"/>Die Prüfung des Lieferscheins erfolgt für Leistungszeiträume vor dem 01.12.2019<BR align="left"/>auf Basis der Werte, die vom NB bzw. vom gMSB übermittelt wurden.<BR align="left"/>Siehe Mitteilung Nr. 6 zur MaKo 2020 (Az.: BK6-18-032) der Bundesnetzagentur<BR align="left"/>vom 28.01.2020.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "9" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>9: </B>Liegt für den im Lieferschein genannten Zeitraum für eine der genannten<BR align="left"/>OBIS-Kennzahlen eine zusätzliche Energiemenge vor, die noch nicht storniert wurde?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A08" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A08</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Für einen Zeitabschnitt liegen für mindestens eine OBIS-Kennzahl mehrere<BR align="left"/>Energiemengen vor.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>10: </B>Entspricht die zuvor vom MSB übermittelte Summe der Energiemengen je<BR align="left"/>OBIS-Kennzahl der Summe der Energiemengen der aus dem Lieferschein<BR align="left"/>korrespondierenden OBIS-Kennzahl für den vom Lieferschein abgedeckten Zeitraum?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "11" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>11: </B>Handelt es sich um eine Marktlokation, deren Netznutzung aufgrund vertraglicher<BR align="left"/>Vereinbarungen abweichend zu den in GPKE Teil 2 Kapitel 3.2.2 beschriebenen<BR align="left"/>Regelungen abgerechnet wird?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "12" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>12: </B>Entspricht die im Lieferschein übermittelte Energiemenge der Energiemenge,<BR align="left"/>welche sich auf Basis der vertraglichen Vereinbarungen ergibt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A09" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A09</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Energiemenge widerspricht vertraglich vereinbarter Logik.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "13" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>13: </B>Entspricht die zuvor vom MSB übermittelte Summe der Energiemengen der Summe der<BR align="left"/>Energiemengen aus dem Lieferschein für den vom Lieferschein abgedeckten Zeit-raum?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A10</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Energiemengen stimmen nicht überein.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "14" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>14: </B>Handelt es sich um eine Marktlokation mit der messtech-nischen Einordnung<BR align="left"/>„keine Messung“ (pauschale Markt-lokation)?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "15" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>15: </B>Entspricht die Energiemenge aus dem Lieferschein den bilateral vertraglichen<BR align="left"/>Vereinbarungen?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A11" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A11</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Energiemenge für pauschale Marktlokation stimmt nicht überein.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "16" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>16: </B>Liegen nach Reklamation für den korrespondierenden Zeit-raum des Lieferscheins<BR align="left"/>die Lastgänge an der Marktlokation vom MSB und ggf. das Leistungsmaximum (bei<BR align="left"/>iMS vom MSB, bei kME mit RLM aus Lastgang vom LF entnommen und bei einem unterjährigen Lieferantenwechsel vom NB) vor?<BR align="left"/>Hinweis: Sollten die Lastgänge an der Marktlokation vom MSB für den<BR align="left"/>korrespondierenden Zeitraum des Lieferscheins nicht vorliegen, müssen diese<BR align="left"/>erst vom LF beim MSB reklamiert worden sein, bevor diese Frage mit nein<BR align="left"/>beantwortet werden darf.<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A12" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A12</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Lastgänge vom MSB an der Marktlokation fehlen und sind beim MSB reklamiert oder<BR align="left"/>vom NB fehlt die Nachricht „Arbeit und Leistungsmaximum Kalenderjahr vor<BR align="left"/>Lieferbeginn".<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "17" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>17: </B>Handelt es sich um eine Marktlokation, deren Netznutzung aufgrund vertraglicher<BR align="left"/>Vereinbarungen abweichend zu den in GPKE Teil 2 Kapitel 3.2.2 beschriebenen<BR align="left"/>Regelungen abgerechnet wird?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "18" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>18: </B>Entspricht die Energiemenge bzw. das Leistungsmaximum aus dem Lieferschein den<BR align="left"/>bilateral vertraglichen Vereinbarungen?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A13" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A13</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Energiemenge bzw. Leistungsmaximum aus dem Lieferschein entspricht nicht der<BR align="left"/>vertraglich vereinbarten Energiemenge.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "19" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>19: </B>Handelt es sich um eine Marktlokation mit der Messtechnischen Einordnung „iMS“?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>20: </B>Entspricht das im Lieferschein übermittelte Leistungsmaximum dem<BR align="left"/>Leistungsmaximum, das zuvor vom MSB über-mittelt wurde oder dem<BR align="left"/>Leistungsmaximum, welches bei einem unterjährigen Lieferantenwechsel vom NB an<BR align="left"/>den LF übermittelt wurde?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A14" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A14</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Leistungsmaximum aus dem Lieferschein ist nicht identisch zum vorliegenden<BR align="left"/>Leistungsmaximum.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "21" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>21: </B>Entspricht das im Lieferschein übermittelte Leistungsmaximum dem vorliegenden<BR align="left"/>Leistungsmaximum beim LF, welches aus dem Lastgang vom MSB entnommen oder das<BR align="left"/>Leistungsmaximum, welches bei einem unterjährigen Lieferantenwechsel vom NB an<BR align="left"/>den LF übermittelt wurde?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A15" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A15</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Leistungsmaximum unplausibel<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "22" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>22: </B>Entspricht jede auf dem Lieferschein vorkommende Energiemenge je Position<BR align="left"/>(OBIS-Kennzahl und Zeitraum) einer Summe der vom MSB zuvor übermittelten ¼<BR align="left"/>h-Werte unter Berücksichtigung von möglichen kaufmännischen Rundungen, wobei<BR align="left"/>ggf. die Energiemengen aus den bisher gemessenen Arbeits- und Leistungswerten<BR align="left"/>des NB berücksichtigt wurden?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A16" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A16</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Energiemenge aus dem Lieferschein entspricht nicht der Summe aus dem Lastgang.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];

    "Start" -> "1" [color="#88a0d6"];
    "1" -> "A01" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "1" -> "2" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "2" -> "A02" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "2" -> "3" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "3" -> "A03" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "3" -> "4" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "4" -> "5" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "4" -> "14" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "5" -> "A04" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "5" -> "6" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "6" -> "7" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "6" -> "8" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "7" -> "A05" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "7" -> "A06" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "8" -> "A07" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "8" -> "9" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "9" -> "A08" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "9" -> "10" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "10" -> "A05" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "10" -> "11" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "11" -> "12" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "11" -> "13" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "12" -> "A05" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "12" -> "A09" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "13" -> "A05" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "13" -> "A10" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "14" -> "15" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "14" -> "16" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "15" -> "A05" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "15" -> "A11" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "16" -> "A12" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "16" -> "17" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "17" -> "18" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "17" -> "19" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "18" -> "A05" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "18" -> "A13" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "19" -> "20" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "19" -> "21" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "A14" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "22" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "21" -> "A15" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "21" -> "22" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "22" -> "A05" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "22" -> "A16" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];

    bgcolor="transparent";
fontname="Roboto, sans-serif";
}
